import re
import pandas as pd


# 获取节点
path = 'json.txt'
with open(path, 'r', encoding="utf-8") as file:
    text = file.read()

# 使用正则表达式提取"name"字段的值
# name_list前11项为地铁线路名，去掉后namelist与idlist即为一一对应
name_list = re.findall(r'"n": "([^"]+)"', text)
id_list = re.findall(r'"rs": "([^"]+)"', text)
Ename_list = re.findall(r'"sp": "([^"]+)"', text)
is_transfor = re.findall(r'"t": "([^"]+)"', text)
poiID = re.findall(r'"poiid": "([^"]+)"', text)

# 修改换乘站ID， 如426 651|426 651 修改为 426 651
id = []
for i in id_list:
    if '|' in i:
        id.append(i.split('|')[0])
    else:
        id.append(i)

# 保存为csv表格
df = pd.DataFrame()
df['ID'] = id
df['地铁站名称'] = name_list
df['英文名称'] = Ename_list
df['是否换乘站'] = is_transfor
df['poiID'] = poiID
# df.to_csv('node.csv',encoding='utf-8')


# 关系解析
Line1 = [
                "181 696",
                "247 696",
                "315 697",
                "380 697",
                "387 696",
                "393 696",
                "398 695",
                "403 693",
                "407 691",
                "411 687",
                "414 683",
                "418 678",
                "421 672",
                "423 664",
                "426 651",
                "429 640",
                "431 632",
                "434 627",
                "437 623",
                "441 620",
                "446 617",
                "453 613",
                "465 611",
                "530 611",
                "600 610",
                "665 609",
                "730 609",
                "833 609",
                "914 609",
                "982 609",
                "1042 609",
                "1108 609",
                "1171 609",
                "1226 609",
                "1282 609",
                "1343 610",
                "1412 610",
                "1462 610",
                "1512 610",
                "1559 610",
                "1627 611"
            ]
Line2 = [
                "960 0",
                "899 0",
                "865 0",
                "862 1",
                "859 2",
                "857 4",
                "856 6",
                "857 43",
                "857 91",
                "857 138",
                "857 184",
                "857 230",
                "857 273",
                "858 315",
                "859 358",
                "858 369",
                "858 370",
                "858 372",
                "856 374",
                "855 375",
                "829 396",
                "791 426",
                "737 469",
                "734 471",
                "732 473",
                "730 476",
                "730 479",
                "730 523",
                "730 569",
                "730 609",
                "731 664",
                "731 743",
                "732 775",
                "733 833",
                "733 895",
                "734 953",
                "735 998",
                "736 1012",
                "738 1020",
                "741 1026",
                "746 1030",
                "753 1033",
                "763 1036",
                "779 1037",
                "808 1037",
                "919 1037",
                "990 1037",
                "1060 1037",
                "1122 1037",
                "1187 1037",
                "1254 1037",
                "1313 1037",
                "1379 1037",
                "1444 1037",
                "1504 1037",
                "1565 1037",
                "1628 1037",
                "1688 1037"
            ]
Line3 = [
                        "170 129",
                        "242 154",
                        "244 155",
                        "245 155",
                        "245 156",
                        "245 156",
                        "246 165",
                        "247 231",
                        "248 305",
                        "248 377",
                        "250 437",
                        "251 518",
                        "251 520",
                        "251 523",
                        "251 525",
                        "253 527",
                        "256 527",
                        "258 527",
                        "420 527",
                        "422 528",
                        "423 528",
                        "424 528",
                        "424 528",
                        "424 528",
                        "424 529",
                        "424 530",
                        "424 532",
                        "424 537",
                        "424 595",
                        "424 651",
                        "423 724",
                        "423 767",
                        "423 825",
                        "423 881",
                        "423 930",
                        "425 941",
                        "431 949",
                        "441 954",
                        "447 955",
                        "453 956",
                        "531 956",
                        "633 956",
                        "734 956",
                        "918 956",
                        "1030 956",
                        "1124 956",
                        "1210 956",
                        "1247 955",
                        "1262 952",
                        "1277 945",
                        "1286 929",
                        "1290 909",
                        "1291 887",
                        "1289 820",
                        "1287 740",
                        "1287 680",
                        "1285 609",
                        "1285 550",
                        "1284 493",
                        "1285 474",
                        "1286 469",
                        "1292 464",
                        "1300 462",
                        "1311 460",
                        "1362 461",
                        "1418 460",
                        "1466 461",
                        "1505 462",
                        "1540 462",
                        "1582 462",
                        "1621 462",
                        "1658 463",
                        "1700 463"
                    ]
Line4 = [
                "632 56",
                "631 107",
                "631 159",
                "631 214",
                "631 273",
                "631 316",
                "632 361",
                "632 362",
                "633 362",
                "697 388",
                "791 426",
                "911 475",
                "913 476",
                "914 478",
                "914 503",
                "914 557",
                "914 609",
                "915 669",
                "916 742",
                "917 820",
                "918 887",
                "918 953",
                "919 1037",
                "920 1127",
                "921 1198",
                "922 1256",
                "922 1312",
                "923 1374",
                "924 1429",
                "924 1481",
                "925 1531",
                "926 1582",
                "926 1587",
                "927 1593",
                "929 1601",
                "932 1608",
                "935 1613",
                "940 1618",
                "947 1621",
                "954 1624",
                "962 1626",
                "970 1627",
                "981 1628",
                "990 1628",
                "1087 1627",
                "1088 1627",
                "1177 1627",
                "1263 1626",
                "1343 1626"
            ]
Line4_extend = [
                "920 1127",
                "920 1127",
                "868 1128",
                "798 1128",
                "737 1128",
                "729 1128",
                "724 1129",
                "720 1130",
                "716 1132",
                "713 1134",
                "712 1137",
                "711 1141",
                "710 1146",
                "710 1160",
                "710 1191",
                "710 1223",
                "710 1254",
                "709 1275",
                "709 1279",
                "708 1281",
                "706 1283",
                "704 1285",
                "701 1287",
                "697 1287",
                "691 1288",
                "673 1288",
                "672 1288",
                "631 1288",
                "589 1287"
            ]
Line5 = [
                "1621 392",
                "1621 460",
                "1621 494",
                "1621 521",
                "1621 524",
                "1620 526",
                "1620 527",
                "1618 528",
                "1615 528",
                "1578 528",
                "1569 529",
                "1564 530",
                "1560 531",
                "1559 535",
                "1559 538",
                "1558 544",
                "1559 574",
                "1559 610",
                "1559 650",
                "1560 695",
                "1560 730",
                "1560 732",
                "1560 734",
                "1559 735",
                "1558 737",
                "1555 737",
                "1552 738",
                "1549 738",
                "1546 738",
                "1505 738",
                "1451 739",
                "1398 739",
                "1341 739",
                "1285 740",
                "1215 740",
                "1139 740",
                "1063 741",
                "988 741",
                "916 742",
                "824 742",
                "731 743",
                "651 744",
                "615 744",
                "611 744",
                "604 745",
                "597 748",
                "426 825",
                "354 856",
                "338 862",
                "320 863",
                "271 863",
                "211 864",
                "148 865",
                "89 865",
                "34 866",
                "6 867",
                "4 867",
                "1 868",
                "1 870",
                "0 873",
                "0 881",
                "1 927",
                "0 993",
                "1 1068",
                "2 1128",
                "2 1185",
                "2 1245"
            ]
Line11 = [
                "1700 460",
                "1737 460",
                "1773 460",
                "1813 460",
                "1859 461",
                "1908 461",
                "1948 461",
                "1958 461",
                "1966 461",
                "1972 462",
                "1978 464",
                "1983 466",
                "1987 469",
                "1990 474",
                "1992 478",
                "1992 483",
                "1992 491",
                "1993 533",
                "1993 574",
                "1993 615",
                "1994 655",
                "1994 701",
                "1994 746",
                "1995 788",
                "1995 827",
                "1995 869",
                "1996 928",
                "1996 993",
                "1996 1054",
                "1997 1117",
                "1997 1183",
                "1998 1243",
                "1998 1304",
                "1999 1356",
                "1999 1401",
                "1999 1451",
                "2000 1505",
                "2000 1558"
            ]


real_Line1, real_Line2, real_Line3, real_Line4, real_Line4_extend, real_Line5, real_Line11 = [],[],[],[],[],[],[]

# for Line in [Line1, Line2, Line3, Line4, Line4_extend, Line5, Line11]:
# 处理冗余边

# 1号线
for i in Line1:
    if i in id:
        real_Line1.append(i)
Line1 = real_Line1
adj_Line1 = Line1[1:] + Line1[:1]
# 防止生成环
Line1, adj_Line1 = Line1[:-1], adj_Line1[:-1]

# 以下同理
# 2号线
for i in Line2:
    if i in id:
        real_Line2.append(i)
Line2 = real_Line2
adj_Line2 = Line2[1:] + Line2[:1]
Line2, adj_Line2 = Line2[:-1], adj_Line2[:-1]

# 3号线
for i in Line3:
    if i in id:
        real_Line3.append(i)
Line3 = real_Line3
adj_Line3 = Line3[1:] + Line3[:1]
Line3, adj_Line3 = Line3[:-1], adj_Line3[:-1]
# 4号线
for i in Line4:
    if i in id:
        real_Line4.append(i)
Line4 = real_Line4
adj_Line4 = Line4[1:] + Line4[:1]
Line4, adj_Line4 = Line4[:-1], adj_Line4[:-1]

# 4号线支线
for i in Line4_extend:
    if i in id:
        real_Line4_extend.append(i)
Line4_extend = real_Line4_extend
adj_Line4_extend = Line4_extend[1:] + Line4_extend[:1]
Line4_extend, adj_Line4_extend = Line4_extend[:-1], adj_Line4_extend[:-1]

# 5号线
for i in Line5:
    if i in id:
        real_Line5.append(i)
Line5 = real_Line5
adj_Line5 = Line5[1:] + Line5[:1]
Line5, adj_Line5 = Line5[:-1], adj_Line5[:-1]

# 11号线
for i in Line11:
    if i in id:
        real_Line11.append(i)
Line11 = real_Line11
adj_Line11 = Line11[1:] + Line11[:1]
Line11, adj_Line11 = Line11[:-1], adj_Line11[:-1]

# for i in ['一号线','二号线','三号线','四号线','四号线支线','五号线','十一号线']:
# 生成表格
subway_1 = pd.DataFrame()
subway_1['起始节点'] = Line1
subway_1['目标节点'] = adj_Line1
subway_1['所在路线'] = '一号线'
subway_1['起始站'] = '木渎'
subway_1['终点站'] = '钟南街'
subway_1.to_csv('一号线_test.csv', encoding='utf-8')

subway_2 = pd.DataFrame()
subway_2['起始节点'] = Line2
subway_2['目标节点'] = adj_Line2
subway_2['所在路线'] = '二号线'
subway_2['起始站'] = '骑河'
subway_2['终点站'] = '桑田岛'
subway_2.to_csv('二号线_test.csv', encoding='utf-8')

subway_3 = pd.DataFrame()
subway_3['起始节点'] = Line3
subway_3['目标节点'] = adj_Line3
subway_3['所在路线'] = '三号线'
subway_3['起始站'] = '苏州新区火车站'
subway_3['终点站'] = '唯亭'
subway_3.to_csv('三号线_test.csv', encoding='utf-8')

subway_4 = pd.DataFrame()
subway_4['起始节点'] = Line4
subway_4['目标节点'] = adj_Line4
subway_4['所在路线'] = '四号线'
subway_4['起始站'] = '同里'
subway_4['终点站'] = '龙道浜'
subway_4.to_csv('四号线_test.csv', encoding='utf-8')

subway_44 = pd.DataFrame()
subway_44['起始节点'] = Line4_extend
subway_44['目标节点'] = adj_Line4_extend
subway_44['所在路线'] = '四号线支线'
subway_44['起始站'] = '红庄'
subway_44['终点站'] = '木里'
subway_44.to_csv('四号线支线_test.csv', encoding='utf-8')

subway_5 = pd.DataFrame()
subway_5['起始节点'] = Line5
subway_5['目标节点'] = adj_Line5
subway_5['所在路线'] = '五号线'
subway_5['起始站'] = '太湖香山'
subway_5['终点站'] = '阳澄湖南'
subway_5.to_csv('五号线_test.csv', encoding='utf-8')

subway_11 = pd.DataFrame()
subway_11['起始节点'] = Line11
subway_11['目标节点'] = adj_Line11
subway_11['所在路线'] = '十一号线'
subway_11['起始站'] = '唯亭'
subway_11['终点站'] = '花桥'
subway_11.to_csv('十一号线_test.csv', encoding='utf-8')
